Add support for bindcar
Signed-off-by: Erick Bourgeois <erick@jeb.ca>
